In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [3]:
%sql SELECT * FROM t_songplay LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 10, 0, 15, 27, 796000), '96', None, None, 132, 'free', 'Richmond, VA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4'),
 (datetime.datetime(2018, 11, 10, 0, 19, 28, 796000), '96', None, None, 132, 'free', 'Richmond, VA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4'),
 (datetime.datetime(2018, 11, 10, 0, 23, 37, 796000), '96', None, None, 132, 'free', 'Richmond, VA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4'),
 (datetime.datetime(2018, 11, 10, 0, 29, 18, 796000), '96', None, None, 132, 'free', 'Richmond, VA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.77.4 (KHTML, like Gecko) Version/7.0.5 Safari/537.77.4'),
 (datetime.datetime(2018, 11, 10, 4, 1, 42, 796000), '26', None, None, 433, 'free', 'San Jose-Sunnyvale-Santa Clara, CA', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36')]

In [4]:
%sql SELECT * FROM t_user LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(96, 'Cierra', 'Finley', 'F', 'free'),
 (96, 'Cierra', 'Finley', 'F', 'free'),
 (96, 'Cierra', 'Finley', 'F', 'free'),
 (96, 'Cierra', 'Finley', 'F', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [5]:
%sql SELECT * FROM t_song LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, 148.03546),
 ('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 218.93179),
 ('SOYMRWW12A6D4FAB14', 'The Moon And I (Ordinary Day Album Version)', 'ARKFYS91187B98E58F', 0, 267.7024),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, 209.60608),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363)]

In [6]:
%sql SELECT * FROM t_artist LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', 35.14968, -90.04892),
 ('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', nan, nan),
 ('ARKFYS91187B98E58F', 'Jeff And Sheri Easter', '', nan, nan),
 ('ARXR32B1187FB57099', 'Gob', '', nan, nan),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan)]

In [7]:
%sql SELECT * FROM t_time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 10, 0, 15, 27, 796000), 0, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 0, 19, 28, 796000), 0, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 0, 23, 37, 796000), 0, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 0, 29, 18, 796000), 0, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 4, 1, 42, 796000), 4, 10, 45, 11, 2018, 5)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

test = None